app/controllers/songs_controller.rb

	def index
		@songs = Song.where(:user_id => current_user.id)
---
SELECT "songs".* FROM "songs" WHERE "songs"."user_id" = ?  [["user_id", 1]]

	def create


		if Song.exists?(title: params[:title], artist: params[:artist])
			@song =Song.find_by_artist_and_title(params[:artist], params[:title])

			@song.increment!(:num_added, 1)
			@song.save
			redirect_to '/songs_index'
		else
			# render plain: params
			@song = Song.new(song_params)
			if @song.save
---
SELECT  "songs".* FROM "songs" WHERE "songs"."artist" = ? AND "songs"."title" = ? LIMIT 1  [["artist", "Prince"], ["title", "Purple Rain"]]
SELECT  1 AS one FROM "songs" WHERE "songs"."title" = ? AND "songs"."artist" = ? LIMIT 1  [["title", ""], ["artist", ""]]
UPDATE "songs" SET "num_added" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["num_added", 3], ["updated_at", "2016-09-26 20:09:30.375109"], ["id", 1]]
INSERT INTO "songs" ("artist", "title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["artist", "lcd sound system "], ["title", "dance yourself clean"], ["user_id", 1], ["created_at", "2016-09-26 18:04:44.183399"], ["updated_at", "2016-09-26 18:04:44.183399"]]